Repository: Abdullah-T3/Rent_Cars
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Cars
ar: سيارات

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

source: Register
ar: تسجيل

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: User Type
ar: نوع المستخدم

source: Project ID
ar: رقم المشروع

source: Login Error
ar: خطأ في تسجيل الدخول

source: Register Error
ar: خطأ في التسجيل

source: Register Success
ar: تم التسجيل بنجاح

source: Tasks
ar: المهام

source: Add Task
ar: اضافة مهمة

# WelcomeMassage
source: Welcome to Cars
ar: مرحبا بك في تطبيق الحجوزات

source: Plate Number
ar: رقم اللوحة

source: Brand
ar: الماركة

source: Model
ar: الموديل

source: Year of Manufacture
ar: سنة الصنع

source: Odometer Reading
ar: قراءة العداد

source: Next Oil Change
ar: تغيير الزيت

source: Create
ar: انشاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Rental Amount
ar: مبلغ الايجار

source: Rental Date
ar: تاريخ الايجار

source: Return Date
ar: تاريخ العودة

source: Customer Name
ar: اسم العميل

# booking_date
source: Rental Date
ar: تاريخ الحجز

source: Pickup Date
ar: تاريخ الاستلام

source: Customer ID
ar: رقم العميل

source: Description
ar: الوصف

source: Rental Days
ar: عدد الايام

source: Rental Kilometers
ar: تسليم كم

source: Active Order
ar: الحجوزات الجارية

source: Expired Order
ar: الحجوزات المنتهية

source: Please Enter Your Password
ar: الرجاء ادخال كلمة المرور

source: Please Enter Your Username
ar: الرجاء ادخال اسم المستخدم

source: Please Enter Your Email
ar: الرجاء ادخال البريد الالكتروني

source: Please Enter Your Name
ar: الرجاء ادخال الاسم

source: Please Enter Your Phone
ar: الرجاء ادخال رقم الهاتف

source: Continue to login
ar: اكمل الباينات لتسجيل الدخول

source: Invalid username or password
ar: اسم المستخدم او كلمة المرور غير صحيحة

source: Switch to Arabic
ar: تبديل للعربي

source: Settings Page
ar: صفحة الاعدادات

source: Change Language
ar: تغيير اللغة

source: Settings
ar: الاعدادات

source: Order
ar: الحجز

source: Orders
ar: الحجوزات

source: Customer Mobile
ar: رقم الهاتف

source: Car License Plate
ar: رقم اللوحة

source: Car Name
ar: اسم السيارة

source: Add Car
ar: اضافة سيارة

source: Car added successfully
ar: تم اضافة السيارة بنجاح

source: Car updated successfully
ar: تم تحديث السيارة بنجاح

source: Car deleted successfully
ar: تم حذف السيارة بنجاح

source: Car not found
ar: السيارة غير موجودة

source: Car not deleted
ar: السيارة لا يمكن حذفها

source: Add Order
ar: اضافة حجز

source: Order added successfully
ar: تم اضافة الحجز بنجاح

source: Order updated successfully
ar: تم تحديث الحجز بنجاح

source: Order deleted successfully
ar: تم حذف الحجز بنجاح

source: Order not found
ar: الحجز غير موجود

source: Order not deleted
ar: الحجز لا يمكن حذفه

source: Customers
ar: العملاء

source: Please Enter Customer Name
ar: الرجاء ادخال الاسم

source: Please Enter Customer Mobile
ar: الرجاء ادخال رقم الهاتف

source: Please Enter Car Name
ar: الرجاء ادخال اسم السيارة

source: Please Enter Car License Plate
ar: الرجاء ادخال رقم اللوحة

source: Please Enter Brand
ar: الرجاء ادخال الماركة

source: Please Enter Model
ar: الرجاء ادخال الموديل

source: Please Enter Year of Manufacture
ar: الرجاء ادخال سنة الصنع

source: Please Enter Odometer Reading
ar: الرجاء ادخال قراءة العداد

source: Please Enter Next Oil Change
ar: الرجاء ادخال تغيير الزيت

source: Please Enter Rental Amount
ar: الرجاء ادخال المبلغ

source: Please Enter Rental Date
ar: الرجاء ادخال تاريخ الايجار

source: Please Enter Return Date
ar: الرجاء ادخال تاريخ العودة

source: Please Enter Customer ID
ar: الرجاء ادخال رقم هوية العميل

source: Please Enter Rental Days
ar: الرجاء ادخال عدد الايام

source: Please Enter Rental Kilometers
ar: الرجاء ادخال عدد الكيلومتر

source: Please Enter Pickup Date
ar: الرجاء ادخال تاريخ الاستلام

source: Remove Image
ar: حذف صورة

source: Add Image
ar: اضافة صورة

source: Take Photo
ar: التقط صورة

source: Upload Photo
ar: رفع صورة

source: Add Customer
ar: اضافة عميل

source: Select From Gallery
ar: تحديد من المعرض

source: Add Car
ar: اضافة سيارة

source: Add Customer
ar: اضافة عميل

source: Add Order
ar: اضافة حجز

source: Edit Car
ar: تعديل سيارة

source: Edit Customer
ar: تعديل عميل

source: Edit Order
ar: تعديل حجز

source: Update Car
ar: تحديث سيارة

source: Update Customer
ar: تحديث عميل

source: Update Order
ar: تحديث حجز

source: Delete Car
ar: حذف سيارة

source: Delete Customer
ar: حذف عميل

source: Delete Order
ar: حذف حجز

source: Expenses
ar: المصاريف

source: Expenses not found
ar: المصروفات غير موجودة

source: Expenses not deleted
ar: المصروفات لا يمكن حذفها

source: Add Expenses
ar: اضافة مصروف

source: Update Expenses
ar: تحديث المصروفات

source: Delete Expenses
ar: حذف المصروفات

source: Car Details
ar: تفاصيل السيارة

source: Actions
ar: الاجراءات

source: Date
ar: التاريخ

source: Amount
ar: المبلغ

source: Remaining
ar: المتبقي

source: Paid Amount
ar: المبلغ المدفوع

source: Cost
ar: التكلفة

source: Save
ar: حفظ

source: Cancel
ar: الغاء

source: Check Internet
ar: التحقق من الانترنت

source: No Internet
ar: لا يوجد انترنت

source: Please check your internet
ar: الرجاء التحقق من الانترنت

source: No internet connection
ar: لا يوجد انترنت

source: Car data updated
ar: تم تحديث بيانات السيارة

source: Expense added successfully
ar: تمت اضافة المصروف بنجاح

source: Expense updated successfully
ar: تم تحديث المصروف بنجاح

source: Expense deleted successfully
ar: تم حذف المصروف بنجاح

source: Expense not found
ar: المصروف غير موجود

source: Expense not deleted
ar: المصروف لا يمكن حذفه

source: Add Task
ar: اضافة مهمة

source: Edit Task
ar: تعديل مهمة

source: Update Task
ar: تحديث مهمة

source: Delete Task
ar: حذف مهمة

source: Task added successfully
ar: تمت اضافة المهمة بنجاح

source: Task updated successfully
ar: تم تحديث المهمة بنجاح

source: Task deleted successfully
ar: تم حذف المهمة بنجاح

source: Task not found
ar: المهمة غير موجودة

source: Task not deleted
ar: المهمة لا يمكن حذفها

source: Add Task Type
ar: اضافة نوع المهمة

source: Edit Task Type
ar: تعديل نوع المهمة

source: Update Task Type
ar: تحديث نوع المهمة

source: Delete Task Type
ar: حذف نوع المهمة

source: Task type added successfully
ar: تمت اضافة نوع المهمة بنجاح

source: Task type updated successfully
ar: تم تحديث نوع المهمة بنجاح

source: Task type deleted successfully
ar: تم حذف نوع المهمة بنجاح

source: Task type not found
ar: نوع المهمة غير موجود

source: Task type not deleted
ar: نوع المهمة لا يمكن حذفه

source: Success
ar: نجاح

source: Select Date
ar: اختر التاريخ
